%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 功能：线性Kalman滤波器的更新函数
% 编写：robinsin,nudt-4
% 备注：
% 日期：2009-10-29
% 测试：*****
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%5
%FUN_KF_PREDICT  执行Kalman滤波的更新部分
%
% 语法:
%   [XX,PP] = Fun_KF_Update(X1,P1,Z,H,R)
%
% 输入:
%   X1 - [nx1]   t1时刻的状态预测值
%   P1 - [nxn]   t1时刻的状态预测协方差
%   Z -  [mx1]   t1时刻的量测矢量
%   H -  [mxn]   量测矩阵
%   R -  [mxm]   量测协方差阵
%
% 输出:
%   XX - [nx1]   t1时刻的滤波更新值
%   PP - [nxn]   t1时刻的滤波更新协方差
%   
% 描述:
%   线性Kalman滤波器的运动方程和量测方程为
% 
%     X[k] = Phi[k] * X[k-1] + G[k-1] * W[k-1],  W[k-1] ~ N(0,Q)
%     Z[k] = H[k]   * X[k]   + V[k],             V[k]   ~ N(0,R)
% 备注:G*W才是过程噪声,G*Q*G'才是过程噪声的协方差
function [XX,PP] = Fun_KF_Update(X1,P1,Z,H,R)

  Z1 = H*X1;                 % 量测预测值
  S  = H*P1*H'+R;            % 新息协方差矩阵
  K  = P1*H'*inv(S);         % 增益矩阵
  XX = X1 + K * (Z-Z1);      % 滤波

  n = size(X1,1);
  PP =(eye(n)-K*H)*P1;       % 滤波协方差
  % 也可以用下面的公式,他们是等同的
  %   PP = P1 - K*S*K';% 滤波协方差
