%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 功能：线性Kalman预测函数
% 编写：robinsin,nudt-4
% 备注：
% 日期：2009-10-29
% 测试：*****
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%5
%FUN_KF_PREDICT  执行Kalman滤波的预测部分
%
% 语法:
%   [X,P] = FUN_KF_PREDICT(X0,P0,Phi,Q,G)
%
% 输入:
%   X0 - [nx1]   t0时刻的状态滤波值
%   P0 - [nxn]   t0时刻的状态滤波协方差
%   PHI -[nxn]   t0到t1时刻的状态转移矩阵
%   Q -  [pxp]   噪声协方差
%   G -  [nxp]   噪声转换矩阵
%
% 输出:
%   X1 - [nx1]   t1时刻状态预测值
%   P1 - [nxn]   t1时刻状态预测协方差
%   
% 描述:
%     线性Kalman滤波器的运动方程和量测方程为
% 
%     X[k] = Phi[k] * X[k-1] + G[k-1] * W[k-1],  W[k-1] ~ N(0,Q)
%     Y[k] = H[k]   * X[k]   + V[k],             V[k]   ~ N(0,R)
% 备注:G*W才是过程噪声,G*Q*G'才是过程噪声的协方差
function [X1,P1] = Fun_KF_Predict(X0,P0,Phi,Q,G)

  X1 = Phi * X0;                     % 状态预测值
  P1 = Phi * P0 * Phi' + G * Q * G'; % 协方差预测
